src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботыПредприятия</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботыПредприятия.Resource.КоличествоЧасов</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботыПредприятия.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <attributes>
    <name>ПоказательРасчета</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

src/ChartsOfCalculationTypes/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Начисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.Начисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Больничный</name>
      <description>Больничный</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
  </predefined>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

src/CalculationRegisters/Начисления/RecordSetModule.bsl
// Модуль набора записей регистра расчёта "Начисления".
// Содержит экспортную процедуру принудительного расчёта сумм начислений
// для сформированных движений. Вызывается в документах после записи набора.

// Рассчитывает и заполняет колонку "Сумма" для каждой записи набора
// в зависимости от вида расчёта.
// Поддерживаются виды:
//   - Оклад: оплата пропорционально отработанному времени по графику.
//   - Больничный: пособие по временной нетрудоспособности (первые 3 дня за счёт работодателя).
//   - Пользовательские виды расчёта (Предопределенный = Ложь): сумма вычисляется
//     выполнением формулы, заданной в реквизите "ФормулаРасчета" вида расчёта.
//   - Прочие предопределённые виды без явной обработки: сумма = 0 с сообщением.
// После расчёта набор немедленно записывается (замещением).
Процедура РассчитатьСуммуНачисления() Экспорт
    // Начальное количество дней больничного, оплачиваемых работодателем (согласно ТК РФ).
    ДнейБольничногоЗаСчетРаботодателя = 3;
    
    Для Каждого Движение Из ЭтотОбъект Цикл
        
        Если Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад Тогда
            // ---- Расчёт оклада ----
            Оклад            = Движение.ПоказательРасчета;   // месячный оклад из движения
            ОтработаноЧасов  = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия).Итог("КоличествоЧасов");
            НормаЧасов       = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия).Итог("КоличествоЧасов"); 
            РезультатРасчета = Оклад * ОтработаноЧасов / НормаЧасов;   // пропорция отработанного времени
            Движение.Сумма   = РезультатРасчета;
            
        ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный Тогда
            // ---- Расчёт больничного ----
            Оклад = Движение.ПоказательРасчета;   // в контексте данного документа – оклад сотрудника
            // Условная стоимость одного дня болезни (по средней за 2 года упрощённо = Оклад * 24 / 730)
            СтоимостьДняПоБолезни = Оклад * 24 / 730;
            // Количество дней больничного (разница дат в днях)
            КоличествоДнейБолезни = (КонецДня(Движение.ПериодДействияКонец)+1 - Движение.ПериодДействияНачало)/86400;
            
            // Лимит дней, оплачиваемых работодателем, используется общий для всего набора.
            Если КоличествоДнейБолезни <= ДнейБольничногоЗаСчетРаботодателя Тогда
                РезультатРасчета = КоличествоДнейБолезни * СтоимостьДняПоБолезни;
                ДнейБольничногоЗаСчетРаботодателя = ДнейБольничногоЗаСчетРаботодателя - КоличествоДнейБолезни;
            Иначе 
                РезультатРасчета = ДнейБольничногоЗаСчетРаботодателя * СтоимостьДняПоБолезни;
                ДнейБольничногоЗаСчетРаботодателя = 0;
            КонецЕсли;
            Движение.Сумма = РезультатРасчета;
            
        ИначеЕсли Движение.ВидРасчета.Предопределенный = Ложь Тогда           
            // ---- Пользовательский вид расчёта (формула) ----
            РезультатРасчета = Неопределено;
            ФормулаРасчета = Движение.ВидРасчета.ФормулаРасчета;    
            Выполнить(ФормулаРасчета);
            Движение.Сумма = РезультатРасчета;
            
        Иначе
            // Для остальных предопределённых видов, не обработанных выше,
            // сумма остаётся нулевой, пользователю выдаётся сообщение.
            Движение.Сумма = 0;
            СообщениеПользователю = Новый СообщениеПользователю;
            СообщениеПользователю.Текст = СтрШаблон("Для вида расчета %1 не задана формула расчета!", Движение.ВидРасчета);
            СообщениеПользователю.Сообщить();
        КонецЕсли;    
    КонецЦикла;
    
    // Запись набора с замещением существующих записей (если набор уже был записан ранее).
    ЭтотОбъект.Записать(,Истина);
    
КонецПроцедуры
